updated the vault in conf, and updated readme
